In [1]:
import pandas as pd

In [ ]:
#1. Columna 1 = Gasto/Ventas*100.
#2. Columna 2 = Si Ventas>= 30000, imprimir “Meta Superada”,caso contrario imprimir “Meta no Superada”.
#3. Columna 3 = Si Gasto>Ventas, calcular el sobre gasto.
#4. Obtener el total de las ventas de los últimos 3 meses
#5. Obtener el total de gastos de febrero a abril

In [67]:
#diccionario
ingresos = [
    {"Mes": "Enero", "Ventas":30500,"Gastos":22000},
    {"Mes": "Febrero", "Ventas":35600,"Gastos":23450},
    {"Mes": "Marzo", "Ventas":28300,"Gastos":18100},
    {"Mes": "Abril", "Ventas":33900,"Gastos":35700},
    {"Mes": "Mayo", "Ventas":42500,"Gastos":32450}
]

In [68]:
#crear dataframe de ingresos
df = pd.DataFrame(ingresos)

In [69]:
#indexar por mes
df = df.set_index('Mes')

In [70]:
df

         Ventas  Gastos
Mes
Enero     30500   22000
Febrero   35600   23450
Marzo     28300   18100
Abril     33900   35700
Mayo      42500   32450

In [71]:
#calculo de columna 1
df['Columna1'] = (df['Gastos']/df['Ventas'])*100

In [72]:
df

         Ventas  Gastos    Columna1
Mes
Enero     30500   22000   72.131148
Febrero   35600   23450   65.870787
Marzo     28300   18100   63.957597
Abril     33900   35700  105.309735
Mayo      42500   32450   76.352941

In [73]:
import numpy as np

In [74]:
#calculo columna 2
df['Columna2'] = np.where(df['Ventas'] >=30000, "Meta Superada", "Meta no Superada")

In [75]:
df

         Ventas  Gastos    Columna1          Columna2
Mes
Enero     30500   22000   72.131148     Meta Superada
Febrero   35600   23450   65.870787     Meta Superada
Marzo     28300   18100   63.957597  Meta no Superada
Abril     33900   35700  105.309735     Meta Superada
Mayo      42500   32450   76.352941     Meta Superada

In [76]:
#calculo columna 3, sobre gastos
df['Columna3'] = np.where(df['Gastos'] > df['Ventas'], df['Gastos'] - df['Ventas'], 0)

In [77]:
df

         Ventas  Gastos    Columna1          Columna2  Columna3
Mes
Enero     30500   22000   72.131148     Meta Superada         0
Febrero   35600   23450   65.870787     Meta Superada         0
Marzo     28300   18100   63.957597  Meta no Superada         0
Abril     33900   35700  105.309735     Meta Superada      1800
Mayo      42500   32450   76.352941     Meta Superada         0

In [78]:
#ventas ultimos 3 meses
df['Ventas'].tail(3).sum()

104700

In [79]:
#indexamos por mes
df = df.reset_index('Mes')

In [82]:
df

       Mes  Ventas  Gastos    Columna1          Columna2  Columna3
0    Enero   30500   22000   72.131148     Meta Superada         0
1  Febrero   35600   23450   65.870787     Meta Superada         0
2    Marzo   28300   18100   63.957597  Meta no Superada         0
3    Abril   33900   35700  105.309735     Meta Superada      1800
4     Mayo   42500   32450   76.352941     Meta Superada         0

In [95]:
#df.iloc[df.Mes['Febrero':'Abril']]
df = df.set_index('Mes')

In [96]:
df

         Ventas  Gastos    Columna1          Columna2  Columna3
Mes
Enero     30500   22000   72.131148     Meta Superada         0
Febrero   35600   23450   65.870787     Meta Superada         0
Marzo     28300   18100   63.957597  Meta no Superada         0
Abril     33900   35700  105.309735     Meta Superada      1800
Mayo      42500   32450   76.352941     Meta Superada         0

In [100]:
#gastos de febrero a abril
df = df.loc['Febrero':'Abril']

In [102]:
df['Gastos']

Mes
Febrero    23450
Marzo      18100
Abril      35700
Name: Gastos, dtype: int64